createSpace/app/models/user.rb

  def self.find_from_credentials(username, password)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "billy"], ["LIMIT", 1]]