createSpace/app/controllers/spaces_controller.rb

SELECT "spaces".* FROM "spaces"
---
  def index

    render json: Space.all

INSERT INTO "spaces" ("category", "content", "userid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "art"], ["content", "fuck this shit"], ["userid", 1], ["created_at", "2018-06-02 20:44:56.580140"], ["updated_at", "2018-06-02 20:44:56.580140"]]
---
  def create

    userid = params[:userid]
    category = params[:category]
    content = params[:content]

    newpost = Space.create!({
      userid: userid,
      category: category,
      content: content
    })