createSpace/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    username = params[:username]
    password = params[:password]
    email = params[:email]

    @user = User.create({
      :username => params[:username],
      :password => params[:password],
      :email => params[:email]
    })

SELECT "users".* FROM "users"
---
  def login
    username = params[:username]
    password = params[:password]

    user = User.find_from_credentials username, password